# Flip Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpotDimension..::..Flip Method
SpotDimension Class See Also
---
Flips dimension to the other side of the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.2
# Syntax
C#
---
```text
public void Flip()
```

Visual Basic
---
```text
Public Sub Flip
```

Visual C++
---
```text
public:
void Flip()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | SpotDimension cannot be flipped. |

# See Also
SpotDimension Class
Autodesk.Revit.DB Namespace